app/Controllers/PrestamosController.php

            public function create()
            {
                if ($this->request->is('post')) {
                    $fecha_venc = null;
                    $fecha = date('Y-m-d');

                    $data = [
                        'cliente' => $this->request->getVar('cliente'),
                        'importe' => $this->request->getVar('importe_credito'),
                        'modalidad' => $this->request->getVar('modalidad'),
                        'tasa_interes' => $this->request->getVar('tasa_interes'),
                        'cuotas' => $this->request->getVar('cuotas'),
                        'fecha' => date('Y-m-d H:i:s'),
                        'fecha_venc' => $this->calcularFechaVencimiento($this->request->getVar('modalidad'), $fecha),
                        'id_cliente' => $this->request->getVar('id_cliente'),
                        'id_usuario' =>  $this->session->id_usuario //1
                    ];
                    try {
                        if ($this->prestamos->insert($data) === false) {
---
INSERT INTO `prestamos` (`importe`, `modalidad`, `tasa_interes`, `cuotas`, `fecha`, `fecha_venc`, `id_cliente`, `id_usuario`, `created_at`, `updated_at`) VALUES ('1500', 'MENSUAL', '25', '2', '2024-06-21 13:30:05', '2024-07-21', '1', '1', '2024-06-21 13:30:05', '2024-06-21 13:30:05')

    public function detail($id)
    {
        $data['prestamo'] = $this->prestamos
            ->select('prestamos.*, c.identidad, c.num_identidad, c.nombre AS cliente, c.apellido, c.telefono, c.whatsapp, c.correo, u.nombre AS usuario, u.apellido AS user_apellido')
            ->join('clientes AS c', 'prestamos.id_cliente = c.id')
            ->join('usuarios AS u', 'prestamos.id_usuario = u.id')
            ->where('prestamos.id', $id)->first();
---
SELECT `prestamos`.*, `c`.`identidad`, `c`.`num_identidad`, `c`.`nombre` AS `cliente`, `c`.`apellido`, `c`.`telefono`, `c`.`whatsapp`, `c`.`correo`, `u`.`nombre` AS `usuario`, `u`.`apellido` AS `user_apellido`
FROM `prestamos`
JOIN `clientes` AS `c` ON `prestamos`.`id_cliente` = `c`.`id`
JOIN `usuarios` AS `u` ON `prestamos`.`id_usuario` = `u`.`id`
WHERE `prestamos`.`id` = '41'
 LIMIT 1

    public function reportePagado($id)
    {
        $data['prestamo'] = $this->prestamos
            ->select('prestamos.*, c.identidad, c.num_identidad, c.nombre AS cliente, c.apellido, c.telefono, c.direccion, c.whatsapp, c.correo, u.nombre AS usuario, u.apellido AS user_apellido')
            ->join('clientes AS c', 'prestamos.id_cliente = c.id')
            ->join('usuarios AS u', 'prestamos.id_usuario = u.id')
            ->where('prestamos.id', $id)->first();
---
SELECT `prestamos`.*, `c`.`identidad`, `c`.`num_identidad`, `c`.`nombre` AS `cliente`, `c`.`apellido`, `c`.`telefono`, `c`.`direccion`, `c`.`whatsapp`, `c`.`correo`, `u`.`nombre` AS `usuario`, `u`.`apellido` AS `user_apellido`
FROM `prestamos`
JOIN `clientes` AS `c` ON `prestamos`.`id_cliente` = `c`.`id`
JOIN `usuarios` AS `u` ON `prestamos`.`id_usuario` = `u`.`id`
WHERE `prestamos`.`id` = '41'
 LIMIT 1

                    function reportePagado($prestamoId)
                    {
                        // Código para enviar el reporte
                    }

                    // Si todas las cuotas están pagadas, actualizar el estado del préstamo
                    if ($todasPagadas) {
                        $this->prestamos->update($prestamoId, ['estado' => '0']);
---
UPDATE `prestamos` SET `estado` = '0', `updated_at` = '2024-06-15 14:35:24'
WHERE `prestamos`.`id` IN ('41')